assets/manufactured/openfoam-case-template/simpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    writeCellData
    {
        type            writeCellCentres;
        libs            (fieldFunctionObjects);

        writeControl    writeTime;
    }
    walls
    {
        // Mandatory entries (unmodifiable)
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        surfaceFormat   foam;

        // Mandatory entries (runtime modifiable)
        fields          (C);
        operation       none;
        regionType      patch;
        name            walls;

        // Optional (inherited) entries
        writeFields     true;
        writeControl    writeTime;
    }
    inlet
    {
        // Mandatory entries (unmodifiable)
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        surfaceFormat   foam;

        // Mandatory entries (runtime modifiable)
        fields          (C);
        operation       none;
        regionType      patch;
        name            inlet;

        // Optional (inherited) entries
        writeFields     true;
        writeControl    writeTime;
    }
    outlet
    {
        // Mandatory entries (unmodifiable)
        type            surfaceFieldValue;
        libs            (C);
        surfaceFormat   foam;

        // Mandatory entries (runtime modifiable)
        fields          (C);
        operation       none;
        regionType      patch;
        name            outlet;

        // Optional (inherited) entries
        writeFields     true;
        writeControl    writeTime;
    }
}


// ************************************************************************* //
